
ahu_sections = [
    ('AHU_NAME',   r'(?:Позиция_*(?:заказчика)?:|(?:Номер|Название|№|Имя)?_?(?:установк[иа]|систем[ыа]))|(?:Position)'),
    ('SILENCER',   r'(?:блок_)?шумоглушител[ья]|silencer|sound attenuator'),
    ('FILTER',   r'(?:карманный_)?фильтр(?![аовму]+)|filter'),
    ('HEAT_RECOVERY_SUPPLY',   r'(?:нагреватель_)?гликол\.?(?:иевый)?_рекуператор(?![аовму]+)|(?:glycol_)?energy recovery'),
    ('HEAT_RECOVERY_EXHAUST',   r'(?:охладитель_)?гликол\.?(?:иевый)?_рекуператор(?![аовму]+)|(?:glycol_)?energy recovery'),
    ('HEATER',   r'(?:водяной_)?(?:на|подо|обо)греватель(?!_?гликол\.?(?:иевый)?_рекуператор)(?:_воздуха)?|(?:air_)?heater'),
    ('COOLER',   r'(?:водяной|фреоновый)?_?охладитель(?!_?гликол\.?(?:иевый)?_рекуператор)(?:_воздуха)?|(?:Water|DX)_?(air_)?cooler'),
    ('FAN',   r'вентилятор(?![аовму]+)|fan'),
    ]

hex_pars_air = [
    ('AIR_FLOW_RATE',   r'(?:расход(?!_среды)(?:_воздуха)?)'),
    ('AIR_VELOCITY',   r'(?:скорость(?!_среды|_теплоносителя)(?:_воздуха))'),
    ('INLET_TEMP',   r'(?:температура_)?воздуха?_на_входе'),
    ('OUTLET_TEMP',   r'(?:температура_)?воздуха?_на_выходе'),
    ('AIR_PR_DROP',   r'(?:пот\.?(?:ер[ия])?_?давл\.?(?:ения_)?_?по_воздуху)'),
    ('CAPACITY',   r'(?:пр[оизводительно-]+сть|мощность)')
]

hex_pars_water = [
    ('MEDIUM',   r'(?:вид_)?(?:теплоносител[ья]$|среда$)'),
    ('MEDIUM_FLOW_RATE',   r'(?:расход(?!_воздуха)(?:_среды)?)'),
    ('MEDIUM_VELOCITY',   r'(?:скорость(?!_воздуха)(?:_теплоносителя))'),
    ('MEDIUM_IN_OUTLET_TEMP',   r"""(?:температура_)?(?:теплоносител[ья]|сред[ыа])?(?:_на_)?входе?_\/_(?:температура_)?
                                        (?:теплоносител[ья]|сред[ыа])?(?:_на_)?выходе?"""),
    ('MEDIUM_INLET_TEMP',   r'(?:температура_)?(?:теплоносител[ья]|сред[ыа])(?:_на_)?входе?'),
    ('MEDIUM_OUTLET_TEMP',   r'(?:температура_)?(?:теплоносител[ья]|сред[ыа])(?:_на_)?выходе?'),
    ('MEDIUM_PR_DROP',   r'(?:пот\.?(?:ер[ия])?_?давл\.?(?:ения_)?_?(?:теплоносител[ья]|сред[ыа]))'),
    ('MEDIUM_HEX_VOLUME',   r'(?:объем(?:_теплоносител[ья]|сред[ыа])?)'),
    ('HEX_ROWS',   r'рядность'),
    ('HEX_INLET_DN',   r'(?:соединение|диаметр подсоединения)_(?:на_)?вход[еа]?'),
    ('HEX_OUTLET_DN',   r'(?:соединение|диаметр подсоединения)_(?:на_)?выход[еа]?')
]

# hex_pars_air2 = [
#     ('AIR_FLOW_RATE',   r'(?:расход(?!\sсреды)(?:\sвоздуха)?)\s*\[?\w*\/?\w*\]?\,\s(\d{1,4}[\,\.]?\d{1,4})'),
#     ('AIR_VELOCITY',   r'(?:скорость(?!\sсреды|\sтеплоносителя)(?:\sвоздуха)?)\s*\[?\w*\/?\w*\]?\,\s(\d{1,4}\,?\d{1,4})'),
#     ('INLET_TEMP',   r'(?:температура\s)?воздуха?\sна\sвходе\s*\[?\w*\]?\,\s(\-?\d{1,3}\,?\d{0,2})'),
#     ('OUTLET_TEMP',   r'(?:температура\s)?воздуха?\sна\sвыходе\s*\[?\w*\]?\,\s(\-?\d{1,3}\,?\d{0,2})'),
#     ('AIR_PR_DROP',   r'(?:пот\.?(?:ер[ия])?\s?давл\.?(?:ения\s)?\s?по\sвоздуху)\s*\[?\w*\]?\,\s(\-?\d{1,3}\,?\d{0,2})'),
#     ('CAPACITY',   r'(?:пр[оизводительно-]+сть|мощность)\s*\[?\w*\]?\,\s(\-?\d{1,3}\,?\d{0,2})')
# ]

# hex_pars_water2 = [
#     ('MEDIUM',   r'(?:теплоноситель|среда)\s*\,\s(\d{0,2}\s?\%\s?\w+\s?\w+)'),
#     ('MEDIUM_FLOW_RATE',   r'(?:расход(?!\sвоздуха)(?:\sсреды)?)\s*\[?\w*\/?\w*\]?\,\s(\d{1,4}\,.?\d{1,4})'),
#     ('MEDIUM_VELOCITY',   r'(?:скорость(?!\sвоздуха)(?:\sтеплоносителя)?)\s*\[?\w*\/?\w*\]?\,\s(\d{1,4}\,?\d{1,4})'),
#     ('MEDIUM_IN_OUTLET_TEMP',   r"""(?:температура\s)?(?:теплоносител[ья]|сред[ыа]\s)?(?:на\s)?входе?\s\/\s(?:температура\s)?
#                                         (?:теплоносител[ья]|сред[ыа]\s)?(?:на\s)?выходе?\s*\[?\w*\]?\,\s(\-?\d{1,3}\,?
#                                         \d{0,2})\s\/\s(\-?\d{1,3}\,?\d{0,2})"""),
#     ('MEDIUM_INLET_TEMP',   r'(?:температура\s)?(?:теплоносител[ья]|сред[ыа]\s)(?:на\s)?входе?'),
#     ('MEDIUM_OUTLET_TEMP',   r'(?:температура\s)?(?:теплоносител[ья]|сред[ыа]\s)(?:на\s)?выходе?'),
#     ('MEDIUM_PR_DROP',   r'(?:пот\.?(?:ер[ия])?\s?давл\.?(?:ения\s)?\s?(?:теплоносител[ья]|сред[ыа]))\s*\[?\w*\]?\,\s(\d{1,3}\,?\d{0,2})'),
#     ('MEDIUM_HEX_VOLUME',   r'(?:объем(?:\sтеплоносител[ья]|сред[ыа])?)\s*\[?\w*\]?\,\s(\d{1,3}\,?\d{0,2})'),
#     ('HEX_ROWS',   r'рядность\s*\,\s(\d)'),
#     ('HEX_INLET_DN',   r'(?:соединение|диаметр подсоединения)\s(?:на\s)?вход[еа]?\s*\,\s([dnду]{0,2}\s?\d{1,2}\/?\d{1,2}?)'),
#     ('HEX_OUTLET_DN',   r'(?:соединение|диаметр подсоединения)\s(?:на\s)?выход[еа]?\s*\,\s([dnду]{0,2}\s?\d{1,2}\/?\d{1,2}?)')
# ]


AHU_SEC_REGEX = '|'.join('(?P<%s>%s)+?' % pair for pair in ahu_sections)
HEX_PARS_AIR_REGEX = '|'.join('(?P<%s>%s)+?' % pair for pair in hex_pars_air)
HEX_PARS_WATER_REGEX = '|'.join('(?P<%s>%s)+?' % pair for pair in hex_pars_water)
